#include "variable.h"

/********************************************************************************
*																485指令接收函数																	*
********************************************************************************/
void UART2_DATA_GET(CUINT8 Data)
{
  UART2_Data_Wait_beat_num = 0;
  UART2_Data_Get_Flag = 1;

  //缓存分配
  QueueAdd(&rxArray_UART2, Data);
}

void UART4_DATA_GET(CUINT8 Data)
{

}

void UART5_DATA_GET(CUINT8 Data)
{

}

/********************************************************************************
*																		NO MORE CODE																*
********************************************************************************/
